code-review/NRB_3471_3546/База_Было/Documents/иц_СводноеПоручение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>иц_СводноеПоручение</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Биржа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Биржи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерПоручения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДЕПО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФормированияОтчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставПоручения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОперацииД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Депонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДЕПО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДЕПО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДЕПОМХ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДЕПОМХ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Биржи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособХранения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИЦ_ОстатокНаНачалоДня</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Д_ОстатокДоОперации</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИЦ_ОстатокНаКонецДня</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Д_ОстатокПослеОперации</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДЕПОПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоХраненияПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепоМХПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДЕПОПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДЕПОМХПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/иц_СводноеПоручение/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ОбработкаУдаленияПроведения(Отказ);
	Для Индекс = 0 По СоставПоручения.Количество() - 1 Цикл
		Объект = Документы.ОперацииЦБ.СоздатьДокумент();
		Объект.НомерСтрокиОснования = Индекс;
		Объект.Заполнить(Ссылка);
		Объект.Дата = ДатаИсполнения;
		Объект.УстановитьНовыйНомер();
		Объект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Выборка = Документы.ОперацииЦБ.Выбрать(НачалоДня(Дата), КонецДня(Дата), Новый Структура("ДокументОснование", Ссылка));
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.ПолучитьОбъект();
		Объект.ПометкаУдаления = Истина;
		Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЦикла;
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Если Дата >= Константы.ИспользоватьНовуюНумерациюС.Получить() Тогда
		Номер = НумераторыОбъектов.ПолучитьНомерДокументаВРазрезеМинуты(Ссылка, Формат(Дата, "ДФ=yyMMdd/HHmm-"), Дата, Префикс);
	Иначе
		Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаИсполнения) Тогда
		ДатаИсполнения = Дата;
	КонецЕсли;
	
	УстановитьНовыйНомер();
	
	ВходящийНомерПоручения = Номер;
	
КонецПроцедуры
